Revit 2024 API
EnergyAnalysisDetailModelOptions.ExportMullions Property
 Indicates if to specify the setting for exporting mullions.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool ExportMullions { get; set; }
Visual Basic
Public Property ExportMullions As Boolean
	Get
	Set
Visual C++
public:
property bool ExportMullions {
	bool get ();
	void set (bool value);
}
Remarks
 When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical shading surface is produced from a mullion based on its centerline, thickness and offset.
See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace